In [47]:
import pandas as pd

In [48]:
s = pd.Series([13,11,14,15,20]) #pandas serisi oluşturma
s

0    13
1    11
2    14
3    15
4    20
dtype: int64

In [49]:
s.index #index bilgierine erişim
"""
s.dtype  tip bilgisini verir
s.size   eleman sayısı
s.ndim   boyut bilgisi
s.values içindeki eleman değerlerine erişim
s.head(x) baştan x kadar gözlem birimi getir
s.tail(x) sondan x kadar gözlem birimi getir
"""

'\ns.dtype  tip bilgisini verir\ns.size   eleman sayısı\ns.ndim   boyut bilgisi\ns.values içindeki eleman değerlerine erişim\ns.head(x) baştan x kadar gözlem birimi getir\ns.tail(x) sondan x kadar gözlem birimi getir\n'

In [50]:
#not values ile type sorgularsak arraye çevirdiği için numpy döner
type(s)

pandas.core.series.Series

In [51]:
type(s.values) 
#index bilgisi ile ilgilenmiyorum demek ondan dolaytı numpy arrayi döndürür

numpy.ndarray

In [52]:
#veri okuma 
a = pd.read_csv("dataSets/advertising.csv")
a.head(3)

      TV  radio  newspaper  sales
1  230.1   37.8       69.2   22.1
2   44.5   39.3       45.1   10.4
3   17.2   45.9       69.3    9.3

In [53]:
import seaborn as sns

In [54]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [55]:
df.shape #boyut bilgisini verir

(891, 15)

In [56]:
df.info() #değişkenlerle ilgili detaylı bilgi verir
#object tipide bizim için category tipindedir

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [57]:
df.columns #değişkenlerin isimleri

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [58]:
df.index #index bilgisini verir

RangeIndex(start=0, stop=891, step=1)

In [59]:
df.describe() #özet istatistik bilgilerini verir

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [60]:
df.describe().T #daha okunabilir formatta ver

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [61]:
df.isnull() #eksik değer var mı

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [62]:
df.isnull().values.any() #değerlerde hiç eksik değer var mı

True

In [63]:
df.isnull().sum() #herbir değişkendeki eksik değerler kaç tane sonucunu verir

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [64]:
df["sex"].head(4) #değişkenin değerlerini seçme

0      male
1    female
2    female
3    female
Name: sex, dtype: object

In [65]:
df["sex"].value_counts() #sınıf değerleri ve kaç tane olduğu bilgisi

male      577
female    314
Name: sex, dtype: int64